12/data/attachments/40c0c8d88b81c3f2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Jonathan_research_Friend_25612_8</nif:username>
            <nif:friendToBeRequested>soap_friends_30227e46-c1fd-41dc-9412-4d1f0c3bbc5f</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>